99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi_resources.c
#include "esp32_mquickjs_wifi_csi_resources.h"

void esp32_mquickjs_wifi_csi_resources_reset_counters(esp32_mquickjs_wifi_csi_resources_t *resources)
{
    if (resources == NULL) return;
#define CSI_RESET(name) atomic_store_explicit(&resources->counters.name, 0, memory_order_relaxed)
    CSI_RESET(callbacks);
    CSI_RESET(accepted);
    CSI_RESET(delivered_frames);
    CSI_RESET(delivered_batches);
    CSI_RESET(filtered_mac);
    CSI_RESET(filtered_bssid);
    CSI_RESET(filtered_frame_type);
    CSI_RESET(filtered_frame_subtype);
    CSI_RESET(dropped_identity_exhausted);
    CSI_RESET(filtered_rssi);
    CSI_RESET(filtered_decimation);
    CSI_RESET(filtered_rate_limit);
    CSI_RESET(filtered_first_word_invalid);
    CSI_RESET(filtered_channel_estimate_invalid);
    CSI_RESET(invalid_callback_data);
    CSI_RESET(dropped_pool_full);
    CSI_RESET(dropped_queue_full);
    CSI_RESET(dropped_frame_too_large);
    CSI_RESET(dropped_closing);
    CSI_RESET(received_bytes);
    CSI_RESET(packet_unavailable);
    CSI_RESET(packet_malformed);
    CSI_RESET(packet_truncated);
    CSI_RESET(dropped_packet_required);
    CSI_RESET(dropped_packet_incomplete);
    CSI_RESET(received_packet_bytes);
#undef CSI_RESET
}

#include <limits.h>
#include <string.h>

static void wifi_csi_resources_clear(
    esp32_mquickjs_wifi_csi_resources_t *resources)
{
    memset(resources, 0, sizeof(*resources));
}

bool esp32_mquickjs_wifi_csi_resources_size(uint32_t capacity, uint32_t max_frame_bytes,
    uint32_t max_packet_bytes, size_t *slots_bytes, size_t *payload_bytes)
{
    if (slots_bytes == NULL || payload_bytes == NULL || capacity == 0 ||
        capacity > ESP32_MQUICKJS_NATIVE_POOL_MAX_CAPACITY || max_frame_bytes == 0 ||
        max_packet_bytes > ESP32_MQUICKJS_WIFI_CSI_MAX_PACKET_BYTES) return false;
    size_t slot_stride = sizeof(esp32_mquickjs_wifi_csi_slot_t) +
        (max_packet_bytes != 0 ? sizeof(esp32_mquickjs_wifi_csi_packet_t) : 0);
    size_t data_stride = (size_t)max_frame_bytes + max_packet_bytes;
    if (data_stride < (size_t)max_frame_bytes ||
        capacity > SIZE_MAX / slot_stride || capacity > SIZE_MAX / data_stride)
        return false;
    *slots_bytes = capacity * slot_stride;
    *payload_bytes = capacity * data_stride;
    return true;
}

bool esp32_mquickjs_wifi_csi_resources_init(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    uint32_t generation,
    uint32_t capacity,
    uint32_t max_frame_bytes,
    uint32_t max_packet_bytes,
    const esp32_mquickjs_wifi_csi_allocator_t *allocator)
{
    uint32_t index;
    size_t slots_bytes, payload_bytes;

    if (resources == NULL || allocator == NULL ||
        allocator->calloc_fn == NULL || allocator->malloc_fn == NULL ||
        allocator->free_fn == NULL || generation == 0U || capacity == 0U ||
        capacity > ESP32_MQUICKJS_NATIVE_POOL_MAX_CAPACITY ||
        !esp32_mquickjs_wifi_csi_resources_size(capacity, max_frame_bytes,
            max_packet_bytes, &slots_bytes, &payload_bytes)) {
        return false;
    }
    wifi_csi_resources_clear(resources);
    resources->allocator = *allocator;
    resources->slots = allocator->calloc_fn(
        1, slots_bytes, allocator->opaque);
    if (resources->slots == NULL) {
        wifi_csi_resources_clear(resources);
        return false;
    }
    resources->payload_storage = allocator->malloc_fn(
        payload_bytes, allocator->opaque);
    if (resources->payload_storage == NULL) {
        allocator->free_fn(resources->slots, allocator->opaque);
        wifi_csi_resources_clear(resources);
        return false;
    }
    if (!esp32_mquickjs_native_pool_init(&resources->pool, capacity)) {
        allocator->free_fn(resources->payload_storage, allocator->opaque);
        allocator->free_fn(resources->slots, allocator->opaque);
        wifi_csi_resources_clear(resources);
        return false;
    }
    resources->generation = generation;
    resources->capacity = capacity;
    resources->max_frame_bytes = max_frame_bytes;
    resources->max_packet_bytes = max_packet_bytes;
    resources->filter.sample_every = 1U;
    resources->filter.valid_only = true;
    _Static_assert(_Alignof(esp32_mquickjs_wifi_csi_slot_t) >=
        _Alignof(esp32_mquickjs_wifi_csi_packet_t), "CSI packet records need aligned slot tail");
    esp32_mquickjs_wifi_csi_packet_t *packets = (void *)(resources->slots + capacity);
    for (index = 0; index < capacity; ++index) {
        resources->slots[index].payload = resources->payload_storage +
            ((size_t)index * ((size_t)max_frame_bytes + max_packet_bytes));
        if (max_packet_bytes != 0) {
            resources->slots[index].packet = &packets[index];
            packets[index].bytes = resources->slots[index].payload + max_frame_bytes;
        }
        atomic_init(&resources->slots[index].return_accounted, true);
        atomic_init(&resources->slots[index].owner,
                    ESP32_MQUICKJS_WIFI_CSI_OWNER_NONE);
    }
    atomic_init(&resources->callbacks_active, 0U);
    atomic_init(&resources->sequence, 0U);
    atomic_init(&resources->accepting, false);
    atomic_init(&resources->identity_exhausted, false);
    return true;
}

bool esp32_mquickjs_wifi_csi_resources_deinit(
    esp32_mquickjs_wifi_csi_resources_t *resources)
{
    esp32_mquickjs_wifi_csi_allocator_t allocator;

    if (resources == NULL || resources->slots == NULL ||
        atomic_load_explicit(&resources->callbacks_active,
                             memory_order_acquire) != 0U ||
        atomic_load_explicit(&resources->counters.leased_frames,
                             memory_order_acquire) != 0U) {
        return false;
    }
    atomic_store_explicit(&resources->accepting, false,
                          memory_order_release);
    allocator = resources->allocator;
    allocator.free_fn(resources->payload_storage, allocator.opaque);
    allocator.free_fn(resources->slots, allocator.opaque);
    wifi_csi_resources_clear(resources);
    return true;
}

void esp32_mquickjs_wifi_csi_resources_set_accepting(
    esp32_mquickjs_wifi_csi_resources_t *resources, bool accepting)
{
    if (resources != NULL) {
        atomic_store_explicit(&resources->accepting, accepting &&
            !atomic_load_explicit(&resources->identity_exhausted, memory_order_acquire),
                              memory_order_release);
    }
}

bool esp32_mquickjs_wifi_csi_callback_enter(
    esp32_mquickjs_wifi_csi_resources_t *resources)
{
    if (resources == NULL) {
        return false;
    }
    atomic_fetch_add_explicit(&resources->callbacks_active, 1U,
                              memory_order_acq_rel);
    atomic_fetch_add_explicit(&resources->counters.callbacks, 1U,
                              memory_order_relaxed);
    if (atomic_load_explicit(&resources->identity_exhausted, memory_order_acquire)) {
        atomic_fetch_add_explicit(&resources->counters.dropped_identity_exhausted, 1, memory_order_relaxed);
        return false;
    }
    if (!atomic_load_explicit(&resources->accepting, memory_order_acquire)) {
        atomic_fetch_add_explicit(&resources->counters.dropped_closing, 1U,
                                  memory_order_relaxed);
        return false;
    }
    return true;
}

void esp32_mquickjs_wifi_csi_callback_leave(
    esp32_mquickjs_wifi_csi_resources_t *resources)
{
    if (resources != NULL) {
        atomic_fetch_sub_explicit(&resources->callbacks_active, 1U,
                                  memory_order_release);
    }
}

