99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi_resources.c
static bool wifi_csi_mac_in_list(const uint8_t mac[6],
                                 const uint8_t list[][6],
                                 uint8_t count)
{
    uint8_t index;

    for (index = 0; index < count; ++index) {
        if (memcmp(mac, list[index], 6U) == 0) {
            return true;
        }
    }
    return false;
}

bool esp32_mquickjs_wifi_csi_filter_accept(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    const esp32_mquickjs_wifi_csi_metadata_t *metadata)
{
    esp32_mquickjs_wifi_csi_filter_t *filter;
    uint32_t phase;

    if (resources == NULL || metadata == NULL) {
        return false;
    }
    filter = &resources->filter;
    if (filter->source_mac_count > ESP32_MQUICKJS_WIFI_CSI_MAX_MAC_FILTERS ||
        filter->destination_mac_count > ESP32_MQUICKJS_WIFI_CSI_MAX_MAC_FILTERS ||
        filter->bssid_count > ESP32_MQUICKJS_WIFI_CSI_MAX_MAC_FILTERS ||
        filter->sample_every == 0 || filter->maximum_rate_hz > 1000000U ||
        (filter->frame_types & ~15U) != 0) return false;
    if ((filter->source_mac_count > 0U &&
         (!(metadata->address_mask & (1U << ESP32_MQUICKJS_WIFI_RX_SOURCE)) ||
          !wifi_csi_mac_in_list(metadata->addresses[ESP32_MQUICKJS_WIFI_RX_SOURCE],
                               filter->source_macs, filter->source_mac_count))) ||
        (filter->destination_mac_count > 0U &&
         (!(metadata->address_mask & (1U << ESP32_MQUICKJS_WIFI_RX_DESTINATION)) ||
          !wifi_csi_mac_in_list(metadata->addresses[ESP32_MQUICKJS_WIFI_RX_DESTINATION],
                               filter->destination_macs, filter->destination_mac_count)))) {
        atomic_fetch_add_explicit(&resources->counters.filtered_mac, 1U, memory_order_relaxed);
        return false;
    }
    if (filter->bssid_count > 0 &&
        (!(metadata->address_mask & (1U << ESP32_MQUICKJS_WIFI_RX_BSSID)) ||
         !wifi_csi_mac_in_list(metadata->addresses[ESP32_MQUICKJS_WIFI_RX_BSSID],
                              filter->bssids, filter->bssid_count))) {
        atomic_fetch_add_explicit(&resources->counters.filtered_bssid, 1, memory_order_relaxed);
        return false;
    }
    if (filter->frame_types_set && ((unsigned)metadata->frame_type > ESP32_MQUICKJS_WIFI_PACKET_UNKNOWN ||
        !(filter->frame_types & (1U << metadata->frame_type)))) {
        atomic_fetch_add_explicit(&resources->counters.filtered_frame_type, 1, memory_order_relaxed);
        return false;
    }
    if (filter->frame_subtypes_set && (!metadata->frame_subtype_available ||
        metadata->frame_subtype > 15 || !(filter->frame_subtypes & (1U << metadata->frame_subtype)))) {
        atomic_fetch_add_explicit(&resources->counters.filtered_frame_subtype, 1, memory_order_relaxed);
        return false;
    }
    /* Identity comes only from this callback's proven PV0 header; a missing
     * header or the SDK misc category cannot masquerade as MAC type 3. */
    if (filter->frame_filter && (!metadata->frame_subtype_available ||
        (unsigned)metadata->frame_type >= ESP32_MQUICKJS_WIFI_PACKET_MISC ||
        metadata->frame_subtype > 15 ||
        !(filter->frame_subtype_masks[metadata->frame_type] & (1U << metadata->frame_subtype)))) {
        atomic_fetch_add_explicit(&resources->counters.filtered_frame_subtype, 1, memory_order_relaxed);
        return false;
    }
    if (filter->minimum_rssi_set && metadata->rssi < filter->minimum_rssi) {
        atomic_fetch_add_explicit(&resources->counters.filtered_rssi, 1U,
                                  memory_order_relaxed);
        return false;
    }
    if (filter->valid_only) {
        bool invalid = false;

        if (metadata->first_word_invalid) {
            atomic_fetch_add_explicit(
                &resources->counters.filtered_first_word_invalid, 1U,
                memory_order_relaxed);
            invalid = true;
        }
        if (metadata->channel_estimate_valid_available &&
            !metadata->channel_estimate_valid) {
            atomic_fetch_add_explicit(
                &resources->counters.filtered_channel_estimate_invalid, 1U,
                memory_order_relaxed);
            invalid = true;
        }
        if (invalid) return false;
    }
    phase = resources->filter_phase;
    resources->filter_phase = phase >= filter->sample_every - 1U ? 0 : phase + 1U;
    if (phase != 0U) {
        atomic_fetch_add_explicit(
            &resources->counters.filtered_decimation, 1U,
            memory_order_relaxed);
        return false;
    }
    if (filter->maximum_rate_hz > 0U &&
        resources->last_accepted_timestamp_set) {
        uint32_t minimum_interval = (1000000U + filter->maximum_rate_hz - 1U) / filter->maximum_rate_hz;
        uint64_t elapsed = metadata->timestamp_us -
            resources->last_accepted_timestamp_us;

        if (metadata->timestamp_us < resources->last_accepted_timestamp_us || elapsed < minimum_interval) {
            atomic_fetch_add_explicit(
                &resources->counters.filtered_rate_limit, 1U,
                memory_order_relaxed);
            return false;
        }
    }
    resources->last_accepted_timestamp_us = metadata->timestamp_us;
    resources->last_accepted_timestamp_set = true;
    return true;
}

static void wifi_csi_slot_account_return(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    esp32_mquickjs_wifi_csi_slot_t *slot)
{
    bool expected = false;

    if (atomic_load_explicit(&slot->lease.returned, memory_order_acquire) &&
        atomic_compare_exchange_strong_explicit(
            &slot->return_accounted, &expected, true,
            memory_order_acq_rel, memory_order_acquire)) {
        atomic_fetch_sub_explicit(&resources->counters.leased_frames, 1U,
                                  memory_order_relaxed);
    }
}

static esp32_mquickjs_wifi_csi_publish_result_t wifi_csi_identity_exhausted(
    esp32_mquickjs_wifi_csi_resources_t *resources)
{
    atomic_store_explicit(&resources->identity_exhausted, true, memory_order_release);
    atomic_store_explicit(&resources->accepting, false, memory_order_release);
    atomic_fetch_add_explicit(&resources->counters.dropped_identity_exhausted, 1, memory_order_relaxed);
    return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_IDENTITY_EXHAUSTED;
}

