99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi_resources.c
esp32_mquickjs_wifi_csi_publish_result_t
esp32_mquickjs_wifi_csi_callback_publish(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    const esp32_mquickjs_wifi_csi_metadata_t *metadata,
    const uint8_t *payload,
    size_t length,
    const esp32_mquickjs_wifi_csi_packet_input_t *packet_input,
    esp32_mquickjs_wifi_csi_publish_fn publish,
    void *publish_opaque)
{
    esp32_mquickjs_wifi_csi_event_t event;
    esp32_mquickjs_wifi_csi_metadata_t normalized_metadata;
    esp32_mquickjs_wifi_csi_slot_t *slot;
    uint16_t slot_index;
    uint32_t slot_generation;

    if (resources == NULL || metadata == NULL || publish == NULL)
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_INVALID;
    if (payload == NULL || length == 0) {
        atomic_fetch_add_explicit(&resources->counters.invalid_callback_data, 1, memory_order_relaxed);
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_INVALID;
    }
    if (atomic_load_explicit(&resources->identity_exhausted, memory_order_acquire))
        return wifi_csi_identity_exhausted(resources);
    if (!atomic_load_explicit(&resources->accepting, memory_order_acquire)) {
        atomic_fetch_add_explicit(&resources->counters.dropped_closing, 1U,
                                  memory_order_relaxed);
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_CLOSING;
    }
    normalized_metadata = *metadata;
    normalized_metadata.address_mask = 0;
    memset(normalized_metadata.addresses, 0, sizeof(normalized_metadata.addresses));
    normalized_metadata.frame_type = ESP32_MQUICKJS_WIFI_PACKET_UNKNOWN;
    normalized_metadata.frame_subtype_available = false;
    normalized_metadata.rx_sequence = UINT32_MAX;
    esp32_mquickjs_wifi_csi_packet_t packet = {0};
    esp32_mquickjs_wifi_csi_packet_result_t prepared = esp32_mquickjs_wifi_csi_packet_prepare(
        &resources->packet_options, packet_input, &packet);
    if (prepared == ESP32_MQUICKJS_WIFI_CSI_PACKET_OK) {
        normalized_metadata.address_mask = packet.header.address_mask;
        memcpy(normalized_metadata.addresses, packet.header.addresses, sizeof(normalized_metadata.addresses));
        normalized_metadata.frame_type = packet.header.type;
        normalized_metadata.frame_subtype = packet.header.subtype;
        normalized_metadata.frame_subtype_available = packet.header.frame_control_valid;
        if (packet.header.sequence_valid)
            normalized_metadata.rx_sequence = packet.header.sequence_control >> 4;
    }
    if (!esp32_mquickjs_wifi_csi_filter_accept(
            resources, &normalized_metadata)) {
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_FILTERED;
    }
    if (length > resources->max_frame_bytes) {
        atomic_fetch_add_explicit(
            &resources->counters.dropped_frame_too_large, 1U,
            memory_order_relaxed);
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_TOO_LARGE;
    }
    if (resources->packet_options.mode != ESP32_MQUICKJS_WIFI_CSI_PACKET_NONE) {
        if (prepared == ESP32_MQUICKJS_WIFI_CSI_PACKET_INCOMPLETE) {
            atomic_fetch_add_explicit(&resources->counters.dropped_packet_incomplete, 1, memory_order_relaxed);
            return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_PACKET_INCOMPLETE;
        }
        if (prepared != ESP32_MQUICKJS_WIFI_CSI_PACKET_OK) {
            atomic_fetch_add_explicit(&resources->counters.packet_unavailable, 1, memory_order_relaxed);
            if (prepared == ESP32_MQUICKJS_WIFI_CSI_PACKET_MALFORMED)
                atomic_fetch_add_explicit(&resources->counters.packet_malformed, 1, memory_order_relaxed);
            if (resources->packet_options.required || resources->packet_options.require_complete) {
                atomic_fetch_add_explicit(&resources->counters.dropped_packet_required, 1, memory_order_relaxed);
                return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_PACKET_REQUIRED;
            }
        }
    }
    if (packet.length > resources->max_packet_bytes) return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_INVALID;
    if (atomic_load_explicit(&resources->sequence, memory_order_relaxed) == UINT32_MAX)
        return wifi_csi_identity_exhausted(resources);
    if (!esp32_mquickjs_native_pool_acquire(&resources->pool, &slot_index)) {
        atomic_fetch_add_explicit(&resources->counters.dropped_pool_full, 1U,
                                  memory_order_relaxed);
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_POOL_FULL;
    }
    slot = &resources->slots[slot_index];
    if (slot->slot_generation == UINT32_MAX) {
        (void)esp32_mquickjs_native_pool_release(&resources->pool, slot_index);
        return wifi_csi_identity_exhausted(resources);
    }
    slot_generation = slot->slot_generation + 1U;
    slot->session_generation = resources->generation;
    slot->slot_generation = slot_generation;
    slot->sequence = atomic_fetch_add_explicit(
        &resources->sequence, 1U, memory_order_relaxed) + 1U;
    slot->metadata = normalized_metadata;
    slot->length = length;
    if (slot->packet != NULL) {
        uint8_t *destination = slot->packet->bytes;
        if (packet.length != 0) memcpy(destination, packet.bytes, packet.length);
        *slot->packet = packet;
        slot->packet->bytes = destination;
    }
    if (length > 0U) {
        memcpy(slot->payload, payload, length);
    }
    atomic_store_explicit(&slot->return_accounted, false,
                          memory_order_release);
    atomic_store_explicit(&slot->owner,
                          ESP32_MQUICKJS_WIFI_CSI_OWNER_EVENT,
                          memory_order_release);
    if (!esp32_mquickjs_native_lease_init(
            &slot->lease, &resources->pool, slot_index, slot_generation)) {
        (void)esp32_mquickjs_native_pool_release(
            &resources->pool, slot_index);
        atomic_store_explicit(&slot->return_accounted, true,
                              memory_order_release);
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_INVALID;
    }
    atomic_fetch_add_explicit(&resources->counters.leased_frames, 1U,
                              memory_order_relaxed);
    event.session_generation = resources->generation;
    event.slot_index = slot_index;
    event.slot_generation = slot_generation;
    if (!publish(&event, publish_opaque)) {
        (void)esp32_mquickjs_wifi_csi_slot_discard_event(resources, &event);
        atomic_fetch_add_explicit(&resources->counters.dropped_queue_full, 1U,
                                  memory_order_relaxed);
        return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_QUEUE_FULL;
    }
    if (packet.truncated)
        atomic_fetch_add_explicit(&resources->counters.packet_truncated, 1, memory_order_relaxed);
    atomic_fetch_add_explicit(&resources->counters.received_packet_bytes, packet.length, memory_order_relaxed);
    atomic_fetch_add_explicit(&resources->counters.accepted, 1U,
                              memory_order_relaxed);
    atomic_fetch_add_explicit(&resources->counters.received_bytes,
                              length > UINT32_MAX ? UINT32_MAX :
                                  (uint32_t)length,
                              memory_order_relaxed);
    return ESP32_MQUICKJS_WIFI_CSI_PUBLISH_ACCEPTED;
}

esp32_mquickjs_wifi_csi_slot_t *esp32_mquickjs_wifi_csi_slot_from_event(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    const esp32_mquickjs_wifi_csi_event_t *event)
{
    esp32_mquickjs_wifi_csi_slot_t *slot;

    if (resources == NULL || event == NULL ||
        event->session_generation != resources->generation ||
        event->slot_index >= resources->capacity) {
        return NULL;
    }
    slot = &resources->slots[event->slot_index];
    if (slot->session_generation != event->session_generation ||
        slot->slot_generation != event->slot_generation ||
        esp32_mquickjs_native_lease_is_stale(
            &slot->lease, event->slot_generation)) {
        return NULL;
    }
    return slot;
}

bool esp32_mquickjs_wifi_csi_slot_retain(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    esp32_mquickjs_wifi_csi_slot_t *slot)
{
    return resources != NULL && slot != NULL &&
           slot->session_generation == resources->generation &&
           esp32_mquickjs_native_lease_retain(
               &slot->lease, slot->slot_generation);
}

bool esp32_mquickjs_wifi_csi_slot_release(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    esp32_mquickjs_wifi_csi_slot_t *slot)
{
    bool released;

    if (resources == NULL || slot == NULL ||
        slot->session_generation != resources->generation) {
        return false;
    }
    released = esp32_mquickjs_native_lease_release(
        &slot->lease, slot->slot_generation);
    wifi_csi_slot_account_return(resources, slot);
    return released;
}

bool esp32_mquickjs_wifi_csi_slot_take_event_owner(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    const esp32_mquickjs_wifi_csi_event_t *event)
{
    esp32_mquickjs_wifi_csi_slot_t *slot =
        esp32_mquickjs_wifi_csi_slot_from_event(resources, event);
    uint8_t expected = ESP32_MQUICKJS_WIFI_CSI_OWNER_EVENT;

