99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_csi/esp32_mquickjs_wifi_csi_resources.c
    return slot != NULL && atomic_compare_exchange_strong_explicit(
        &slot->owner, &expected, ESP32_MQUICKJS_WIFI_CSI_OWNER_PUBLIC,
        memory_order_acq_rel, memory_order_acquire);
}

bool esp32_mquickjs_wifi_csi_slot_discard_event(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    const esp32_mquickjs_wifi_csi_event_t *event)
{
    esp32_mquickjs_wifi_csi_slot_t *slot =
        esp32_mquickjs_wifi_csi_slot_from_event(resources, event);
    uint8_t expected = ESP32_MQUICKJS_WIFI_CSI_OWNER_EVENT;
    bool closed;

    if (slot == NULL || !atomic_compare_exchange_strong_explicit(
            &slot->owner, &expected, ESP32_MQUICKJS_WIFI_CSI_OWNER_CLOSED,
            memory_order_acq_rel, memory_order_acquire)) {
        return false;
    }
    closed = esp32_mquickjs_native_lease_request_close(
        &slot->lease, slot->slot_generation);
    wifi_csi_slot_account_return(resources, slot);
    return closed;
}

bool esp32_mquickjs_wifi_csi_slot_close_public_owner(
    esp32_mquickjs_wifi_csi_resources_t *resources,
    esp32_mquickjs_wifi_csi_slot_t *slot)
{
    uint8_t expected = ESP32_MQUICKJS_WIFI_CSI_OWNER_PUBLIC;
    bool closed;

    if (resources == NULL || slot == NULL ||
        slot->session_generation != resources->generation) {
        return false;
    }
    if (!atomic_compare_exchange_strong_explicit(
            &slot->owner, &expected, ESP32_MQUICKJS_WIFI_CSI_OWNER_CLOSED,
            memory_order_acq_rel, memory_order_acquire)) {
        return false;
    }
    closed = esp32_mquickjs_native_lease_request_close(
        &slot->lease, slot->slot_generation);
    wifi_csi_slot_account_return(resources, slot);
    return closed;
}
